{
  "modelTopology": {
    "keras_version": "2.1.5",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "trainable": true,
            "units": 6000,
            "kernel_regularizer": null,
            "activity_regularizer": null,
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "dtype": "float32",
            "name": "dense_1",
            "kernel_constraint": null,
            "activation": "linear",
            "batch_input_shape": [null, 11],
            "bias_constraint": null,
            "use_bias": true,
            "bias_regularizer": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            }
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_1",
            "trainable": true,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "trainable": true,
            "units": 3000,
            "kernel_regularizer": null,
            "activity_regularizer": null,
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "name": "dense_2",
            "kernel_constraint": null,
            "activation": "linear",
            "bias_constraint": null,
            "use_bias": true,
            "bias_regularizer": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            }
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_2",
            "trainable": true,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "trainable": true,
            "units": 1500,
            "kernel_regularizer": null,
            "activity_regularizer": null,
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "name": "dense_3",
            "kernel_constraint": null,
            "activation": "linear",
            "bias_constraint": null,
            "use_bias": true,
            "bias_regularizer": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            }
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_3",
            "trainable": true,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "trainable": true,
            "units": 1,
            "kernel_regularizer": null,
            "activity_regularizer": null,
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "name": "dense_4",
            "kernel_constraint": null,
            "activation": "linear",
            "bias_constraint": null,
            "use_bias": true,
            "bias_regularizer": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            }
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_4",
            "trainable": true,
            "activation": "linear"
          }
        }
      ]
    },
    "training_config": {
      "metrics": [],
      "loss_weights": null,
      "sample_weight_mode": null,
      "loss": "mean_squared_error",
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "beta_2": 0.9990000128746033,
          "decay": 0.0,
          "amsgrad": false,
          "beta_1": 0.8999999761581421,
          "epsilon": 1e-7,
          "lr": 9.999999747378752e-5
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of22",
        "group1-shard2of22",
        "group1-shard3of22",
        "group1-shard4of22",
        "group1-shard5of22",
        "group1-shard6of22",
        "group1-shard7of22",
        "group1-shard8of22",
        "group1-shard9of22",
        "group1-shard10of22",
        "group1-shard11of22",
        "group1-shard12of22",
        "group1-shard13of22",
        "group1-shard14of22",
        "group1-shard15of22",
        "group1-shard16of22",
        "group1-shard17of22",
        "group1-shard18of22",
        "group1-shard19of22",
        "group1-shard20of22",
        "group1-shard21of22",
        "group1-shard22of22"
      ],
      "weights": [
        { "name": "dense_1/kernel", "shape": [11, 6000], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [6000], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [6000, 3000], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [3000], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [3000, 1500], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [1500], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [1500, 1], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
