{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 22, "batch_input_shape": [null, 11], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "bias_regularizer": null, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "bias_regularizer": null, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_4", "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_4"}}]}, "keras_version": "2.1.5", "backend": "tensorflow", "training_config": {"loss": "mean_squared_error", "loss_weights": null, "sample_weight_mode": null, "metrics": [], "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "lr": 0.009999999776482582, "beta_1": 0.8999999761581421, "decay": 0.0, "amsgrad": false, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [11, 22], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [22], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 11], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [11], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [11, 11], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [11], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [11, 1], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [1], "dtype": "float32"}]}]}